import React from "react";
import { ScrollView, StyleSheet, Text, View } from "react-native";
import { Dimensions } from "react-native";

const screenSize = Dimensions.get("screen");

const ToS = () => {
  return (
    <ScrollView style={styles.background}>
      <View style={styles.box}>
        <Text style={styles.title}>늘봄 이용약관</Text>
        <View style={styles.line} />
        <Text>
          &lt; 늘봄 &gt;('k6a104.p.ssafy.io'이하 '늘봄')은(는) 「개인정보
          보호법」 제 30 조에 따라 정보주체의 개인정보를 보호하고 이와 관련한
          고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이
          개인정보 처리방침을 수립·공개합니다. {"\n"}○ 이 개인정보처리방침은
          2022 년 5 월 4 부터 적용됩니다. {"\n"} {"\n"}제 1 조(개인정보의 처리
          목적) {"\n"}
          &lt; 늘봄 &gt;('k6a104.p.ssafy.io'이하 '늘봄')은(는) 다음의 목적을
          위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적
          이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는
          「개인정보 보호법」 제 18 조에 따라 별도의 동의를 받는 등 필요한
          조치를 이행할 예정입니다. {"\n"}
          1. 홈페이지 회원가입 및 관리 {"\n"}
          회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격
          유지·관리 목적으로 개인정보를 처리합니다. {"\n"} {"\n"}제 2
          조(개인정보의 처리 및 보유 기간) {"\n"}① &lt; 늘봄 &gt;은(는) 법령에
          따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에
          동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.{" "}
          {"\n"}② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다. {"\n"}∙
          1.&lt; 홈페이지 회원가입 및 관리 &gt;{"\n"}∙ &lt; 홈페이지 회원가입 및
          관리 &gt;와 관련한 개인정보는 수집.이용에 관한 동의일로부터&lt;
          지체없이 파기 &gt;까지 위 이용목적을 위하여 보유.이용됩니다.{"\n"}{" "}
          {"\n"}제 3 조(처리하는 개인정보의 항목){"\n"}① &lt; 늘봄 &gt;은(는)
          다음의 개인정보 항목을 처리하고 있습니다. {"\n"}∙ 1&lt; 홈페이지
          회원가입 및 관리 &gt; {"\n"}∙ 필수항목 : 이메일, 비밀번호, 로그인 ID,
          성별, 생년월일, 이름, 신체정보{"\n"} {"\n"}제 4 조(개인정보의 파기절차
          및 파기방법) {"\n"}① &lt; 늘봄 &gt; 은(는) 개인정보 보유기간의 경과,
          처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당
          개인정보를 파기합니다. {"\n"}② 정보주체로부터 동의받은 개인정보
          보유기간이 경과하거나 처리목적이 달성되었음에도 불구하고 다른 법령에
          따라 개인정보를 계속 보존하여야 하는 경우에는, 해당 개인정보를 별도의
          데이터베이스(DB)로 옮기거나 보관장소를 달리하여 보존합니다. {"\n"}③
          개인정보 파기의 절차 및 방법은 다음과 같습니다. {"\n"}
          1. 파기절차 {"\n"}
          &lt; 늘봄 &gt; 은(는) 파기 사유가 발생한 개인정보를 선정하고, &lt;
          늘봄 &gt; 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.{" "}
          {"\n"} {"\n"}제 5 조(정보주체와 법정대리인의 권리·의무 및 그
          행사방법에 관한 사항) {"\n"}① 정보주체는 늘봄에 대해 언제든지 개인정보
          열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다. {"\n"}②
          제 1 항에 따른 권리 행사는늘봄에 대해 「개인정보 보호법」 시행령 제 41
          조제 1 항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수
          있으며 늘봄은(는) 이에 대해 지체 없이 조치하겠습니다.{"\n"}③ 제 1 항에
          따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을
          통하여 하실 수 있습니다.이 경우 “개인정보 처리 방법에 관한 고시(제
          2020-7 호)” 별지 제 11 호 서식에 따른 위임장을 제출하셔야 합니다.{" "}
          {"\n"}④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제 35 조
          제 4 항, 제 37 조 제 2 항에 의하여 정보주체의 권리가 제한 될 수
          있습니다. {"\n"}⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그
          개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수
          없습니다. {"\n"}⑥ 늘봄은(는) 정보주체 권리에 따른 열람의 요구,
          정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나
          정당한 대리인인지를 확인합니다. {"\n"}
          {"\n"}제 6 조(개인정보의 안전성 확보조치에 관한 사항) {"\n"}
          &lt; 늘봄 &gt;은(는) 개인정보의 안전성 확보를 위해 다음과 같은 조치를
          취하고 있습니다. 1. 정기적인 자체 감사 실시 {"\n"}
          개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1 회)으로 자체
          감사를 실시하고 있습니다. {"\n"}
          2. 개인정보에 대한 접근 제한 {"\n"}
          개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의
          부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한
          조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을
          통제하고 있습니다. {"\n"}
          3. 비인가자에 대한 출입 통제 {"\n"}
          개인정보를 보관하고 있는 물리적 보관 장소를 별도로 두고 이에 대해
          출입통제 절차를 수립, 운영하고 있습니다. {"\n"}
          {"\n"}제 7 조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그
          거부에 관한 사항){"\n"}
          늘봄 은(는) 정보주체의 이용정보를 저장하고 수시로 불러오는
          ‘쿠키(cookie)’를 사용하지 않습니다. {"\n"}
          {"\n"}제 8 조 (개인정보 보호책임자에 관한 사항) {"\n"}① 늘봄 은(는)
          개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한
          정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보
          보호책임자를 지정하고 있습니다. {"\n"}∙ ▶ 개인정보 보호책임자 {"\n"}∙
          성명 : 늘봄 {"\n"}∙ 직책 : 팀원 {"\n"}∙ 직급 : 팀원 {"\n"}∙ 연락처
          :01051730879, freessafy104@gmail.com {"\n"}※ 개인정보 보호 담당부서로
          연결됩니다. {"\n"}
          {"\n"}제 9 조(개인정보의 열람청구를 접수·처리하는 부서) {"\n"}
          정보주체는 ｢개인정보 보호법｣ 제 35 조에 따른 개인정보의 열람 청구를
          아래의 부서에 할 수 있습니다. {"\n"}
          &lt; 늘봄 &gt;은(는) 정보주체의 개인정보 열람청구가 신속하게
          처리되도록 노력하겠습니다. {"\n"}∙ ▶ 개인정보 열람청구 접수·처리 부서{" "}
          {"\n"}∙ 부서명 : 늘봄 {"\n"}∙ 담당자 : 늘봄 {"\n"}∙ 연락처 :
          010-5173-0879, freessafy104@gmail.com {"\n"}제 10 조(정보주체의
          권익침해에 대한 구제방법) {"\n"}
          정보주체는 개인정보침해로 인한 구제를 받기 위하여
          개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에
          분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의
          신고, 상담에 대하여는 아래의 기관에 문의하시기 바랍니다. {"\n"}
          1. 개인정보분쟁조정위원회 : (국번없이) 1833-6972 (www.kopico.go.kr){" "}
          {"\n"}2. 개인정보침해신고센터 : (국번없이) 118 (privacy.kisa.or.kr){" "}
          {"\n"}
          3. 대검찰청 : (국번없이) 1301 (www.spo.go.kr) {"\n"}
          4. 경찰청 : (국번없이) 182 (ecrm.cyber.go.kr) {"\n"}
          「개인정보보호법」제 35 조(개인정보의 열람), 제 36 조(개인정보의
          정정·삭제), 제 37 조(개인정보의 처리정지 등)의 규정에 의한 요구에 대
          하여 공공기관의 장이 행한 처분 또는 부작위로 인하여 권리 또는 이익의
          침해를 받은 자는 행정심판법이 정하는 바에 따라 행정심판을 청구할 수
          있습니다. ※ 행정심판에 대해 자세한 사항은
          중앙행정심판위원회(www.simpan.go.kr) 홈페이지를 참고하시기 바랍니다.
          {"\n"}
        </Text>
      </View>
    </ScrollView>
  );
};

export default ToS;

const styles = StyleSheet.create({
  background: {
    paddingHorizontal: 20,
  },
  box: {
    backgroundColor: "white",
    paddingVertical: screenSize.height * 0.02,
    paddingHorizontal: screenSize.width * 0.04,
    margin: screenSize.width * 0.01,
    marginTop: screenSize.height * 0.02,
    borderRadius: 10,
    elevation: 3,
  },
  titleBox: {
    flexDirection: "row",
    justifyContent: "space-between",
    alignItems: "flex-end",
  },
  line: {
    borderBottomColor: "black",
    borderBottomWidth: 1,
    marginVertical: 10,
  },
  title: {
    fontSize: 20,
  },
});
